app/views/beer_clubs/show.html.erb


<% if current_user && (current_user.memberships.select {|m| m.beer_club_id == params[:id].to_i}).empty? %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ?  [["user_id", 2]]