app/controllers/beer_clubs_controller.rb

  def show
    @membershipse = Membership.select {|m| m.user_id == session[:user_id] && m.beer_club_id == params[:id].to_i}
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ?  [["user_id", 2]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."beer_club_id" = ?  [["beer_club_id", 1]]

  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save
---
INSERT INTO "beer_clubs" ("name", "city", "founded", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mikon olut klubi"], ["city", "Kerava"], ["founded", 2016], ["created_at", "2016-02-20 10:11:30.421346"], ["updated_at", "2016-02-20 10:11:30.421346"]]