app/controllers/memberships_controller.rb

  def new
    @membership = Membership.new
    @clubs = BeerClub.all.reject{ |club| current_user.in? club.members }
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def create
    @membership = Membership.new(membership_params)
    club = BeerClub.find membership_params[:beer_club_id]
    if not current_user.in? club.members and @membership.save
---
SELECT  "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["beer_club_id", 1], ["created_at", "2016-02-20 10:11:35.920545"], ["updated_at", "2016-02-20 10:11:35.920545"]]
UPDATE "memberships" SET "user_id" = ?, "updated_at" = ? WHERE "memberships"."id" = ?  [["user_id", 1], ["updated_at", "2016-02-20 10:11:35.927530"], ["id", 1]]

  def destroy
    user = User.find_by id:@membership.user_id
    club = BeerClub.find_by id:@membership.beer_club_id

    @membership.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 11]]